Revit 2027 API
EnergyAnalysisSurface.Corner Property
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Corner { get; }
Public ReadOnly Property Corner As XYZ
	Get
public:
property XYZ^ Corner {
	XYZ^ get ();
}
member Corner : XYZ with get
Property Value
XYZ
Remarks
 The analytical rectangular geometry is typically used in simulation engines.
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace